<?php
header("Content-type: text/html; charset=utf-8");

class rand
{
  public function getData()
  {
    return date("Y-m-d");
  }

  public function getTime()
  {
    return date("H:i:s");
  }

  public function getDataTime()
  {
    return date("Y-m-d  H:i:s");
  }

  public function pass()
  {
    //567
    $chars = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
    $length = mb_strlen($chars, 'utf-8');
    $array = [];
    for ($i = 0; $i < $length; $i++)
      $array[] = mb_substr($chars, $i, 8, 'utf-8');
    $random_keys = $array[array_rand($array, 1)];
    return $random_keys;
  }

  public function xb()
  {
    //567
    $str = '赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴鬱胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍卻璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红游竺权逯盖益桓公万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘司徒司空丌官司寇仉督子车颛孙端木巫马公西漆雕乐正壤驷公良拓跋夹谷宰父谷梁晋楚闫法汝鄢涂钦段干百里东郭南门呼延归海羊舌微生岳帅缑亢况郈有琴梁丘左丘东门西门牟佘佴伯赏南宫墨哈谯笪年爱阳佟第五言福百家姓终';
    $length = mb_strlen($str, 'utf-8');
    $array = [];
    for ($i = 0; $i < $length; $i++)
      $array[] = mb_substr($str, $i, 1, 'utf-8');
    $random_keys = $array[array_rand($array, 1)];
    return $random_keys;
  }

  public function zi()
  {
    //2992
    $str = '有和人这中大为上个国我以要他时来用们生到作地于出就分对成会可主发年动同工也能下过子说产种面而方后多定行学法所民得经十三之进着等部度家电力里如水化高自二理起小物现实加量都两体制机当使点从业本去把性好应开它合还因由其些然前外天政四日那社义事平形相全表间样与关各重新线内数正心反你明看原又么利比或但质气第向道命此变条只没结解问意建月公无系军很情者最立代想已通并提直题党程展五果料象员革位入常文总次品式活设及管特件长求老头基资边流路级少图山统接知较长将组见计别她手角期根论运农指几九区强放决西被干做必战先回则任取据处队南给色光门即保治北造百规热领七海地口东导器压志世金增争济阶油思术极交受联什认六权收证改清已美再转更单风切打白教速花带安场身车例真务具万每目至达走积示议声报斗完类八离华名确才科张信马节话米整空元况今集温传土许步群广石记需段研界拉林律叫且究观越织装影算低持音众书布复容儿须际商非验连断深难近矿千周委素技备半办青省列习响约支般史感劳便团往酸历市克何除消构府称太准精值号率族维划选标写存候毛亲快效斯院查江型眼王按格养易置派层片始却专状育厂京识适属圆包火住调满县局照参红细引听该铁价严首底液官德调随病苏失尔死讲配女黄推显谈罪神艺呢席含企望密批营项防举球英氧势告李台落木帮轮破亚师围注远字材排供河态封另施减树溶怎止案言士均武固叶鱼波视仅费紧爱左章早朝害续轻服试食充兵源判护司足某练差致板田降黑犯负击范继兴似余坚曲输修的故城夫够送笔船占右财吃富春职觉汉画功巴跟虽杂飞检吸助升阳互初创抗考投坏策古径换未跑留钢曾端责站简述钱副尽帝射草冲承独令限阿宣环双请超微让控州良轴找否纪益依优顶础载倒房突坐粉敌略客袁冷胜绝析块剂测丝协重诉念陈仍罗盐友洋错苦夜刑移频逐靠混母短皮终聚汽村云哪既距卫停烈央察烧行迅境若印洲刻括激孔搞甚室待核校散侵吧甲游久菜味旧模湖货损预阻毫普稳乙妈植息扩银语挥酒守拿序纸医缺雨吗针刘啊急唱误训愿审附获茶鲜粮斤孩脱硫肥善龙演父渐血欢械掌歌沙著刚攻谓盾讨晚粒乱燃矛乎杀药宁鲁贵钟煤读班伯香介迫句丰培握兰担弦蛋沉假穿执答乐谁顺烟缩征脸喜松脚困异免背星福买染井概慢怕磁倍祖皇促静补评翻肉践尼衣宽扬棉希伤操垂秋宜氢套笔督振架亮末宪庆编牛触映雷销诗座居抓裂胞呼娘景威绿晶厚盟衡鸡孙延危胶还屋乡临陆顾掉呀灯岁措束耐剧玉赵跳哥季课凯胡额款绍卷齐伟蒸殖永宗苗川炉岩弱零杨奏沿露杆探滑镇饭浓航';
    $length = mb_strlen($str, 'utf-8');
    $array = [];
    for ($i = 0; $i < $length; $i++)
      $array[] = mb_substr($str, $i, 2, 'utf-8');
    $random_keys = $array[array_rand($array, 1)];
    return $random_keys;
  }

  public function sf()
  {
    $strSf = ["北京市", " 天津市", "河北省", " 山西省", " 内蒙古自治区", "辽宁省", " 吉林省", " 黑龙江省", "上海市", " 江苏省", " 浙江省", " 安徽省", " 福建省", " 江西省", " 山东省", " 河南省", " 湖北省", " 湖南省", " 广东省", " 广西壮族自治区", " 海南省", " 重庆市", " 四川省", " 贵州省", " 云南省", " 西藏自治区", " 陕西省", " 甘肃省", " 青海省", " 宁夏回族自治区", " 新疆维吾尔自治区", " 香港特别行政区", " 澳门特别行政区", "台湾省"];
    $key =  array_rand($strSf, 1);
    return $strSf[$key];
  }

  public function sqJson()  //读取json数据  实际并无意义  调试用途
  {
    $strSf = file_get_contents('../public/json/sq.json');
    $arrayJson = json_decode($strSf, true);
    echo "<pre>";
    foreach ($arrayJson as $key => $value){
      print_r('" '.$value['name'].'", ');
    }
  }

  public function sq()
  {
    $strSq =  [" 北京市", " 天津市", " 上海市", " 重庆市", " 邯郸市", " 石家庄市", " 保定市", " 张家口市", " 承德市", " 唐山市", " 廊坊市", " 沧州市", " 衡水市", " 邢台市", " 朔州市", " 忻州市", " 太原市", " 大同市", " 阳泉市", " 晋中市", " 长治市", " 晋城市", " 临汾市", " 吕梁市", " 运城市", " 沈阳市", " 铁岭市", " 大连市", " 鞍山市", " 抚顺市", " 本溪市", " 丹东市", " 锦州市", " 营口市", " 阜新市", " 辽阳市", " 朝阳市", " 盘锦市", " 葫芦岛市", " 长春市", " 吉林市", " 延边朝鲜族自治州", " 四平市", " 通化市", " 白城市", " 辽源市", " 松原市", " 白山市", " 哈尔滨市", " 齐齐哈尔市", " 鸡西市", " 牡丹江市", " 七台河市", " 佳木斯市", " 鹤岗市", " 双鸭山市", " 绥化市", " 黑河市", " 大兴安岭地区", " 伊春市", " 大庆市", " 南京市", " 无锡市", " 镇江市", " 苏州市", " 南通市", " 扬州市", " 盐城市", " 徐州市", " 淮安市", " 连云港市", " 常州市", " 泰州市", " 宿迁市", " 舟山市", " 衢州市", " 杭州市", " 湖州市", " 嘉兴市", " 宁波市", " 绍兴市", " 温州市", " 丽水市", " 金华市", " 台州市", " 合肥市", " 芜湖市", " 蚌埠市", " 淮南市", " 马鞍山市", " 淮北市", " 铜陵市", " 安庆市", " 黄山市", " 滁州市", " 阜阳市", " 宿州市", " 巢湖市", " 六安市", " 亳州市", " 池州市", " 宣城市", " 福州市", " 厦门市", " 宁德市", " 莆田市", " 泉州市", " 漳州市", " 龙岩市", " 三明市", " 南平市", " 鹰潭市", " 新余市", " 南昌市", " 九江市", " 上饶市", " 抚州市", " 宜春市", " 吉安市", " 赣州市", " 景德镇市", " 萍乡市", " 菏泽市", " 济南市", " 青岛市", " 淄博市", " 德州市", " 烟台市", " 潍坊市", " 济宁市", " 泰安市", " 临沂市", " 滨州市", " 东营市", " 威海市", " 枣庄市", " 日照市", " 莱芜市", " 聊城市", " 商丘市", " 郑州市", " 安阳市", " 新乡市", " 许昌市", " 平顶山市", " 信阳市", " 南阳市", " 开封市", " 洛阳市", " 济源市", " 焦作市", " 鹤壁市", " 濮阳市", " 周口市", " 漯河市", " 驻马店市", " 三门峡市", " 武汉市", " 襄樊市", " 鄂州市", " 孝感市", " 黄冈市", " 黄石市", " 咸宁市", " 荆州市", " 宜昌市", " 恩施土家族苗族自治州", " 神农架林区", " 十堰市", " 随州市", " 荆门市", " 仙桃市", " 天门市", " 潜江市", " 岳阳市", " 长沙市", " 湘潭市", " 株洲市", " 衡阳市", " 郴州市", " 常德市", " 益阳市", " 娄底市", " 邵阳市", " 湘西土家族苗族自治州", " 张家界市", " 怀化市", " 永州市", " 广州市", " 汕尾市", " 阳江市", " 揭阳市", " 茂名市", " 惠州市", " 江门市", " 韶关市", " 梅州市", " 汕头市", " 深圳市", " 珠海市", " 佛山市", " 肇庆市", " 湛江市", " 中山市", " 河源市", " 清远市", " 云浮市", " 潮州市", " 东莞市", " 兰州市", " 金昌市", " 白银市", " 天水市", " 嘉峪关市", " 武威市", " 张掖市", " 平凉市", " 酒泉市", " 庆阳市", " 定西市", " 陇南市", " 临夏回族自治州", " 甘南藏族自治州", " 成都市", " 攀枝花市", " 自贡市", " 绵阳市", " 南充市", " 达州市", " 遂宁市", " 广安市", " 巴中市", " 泸州市", " 宜宾市", " 资阳市", " 内江市", " 乐山市", " 眉山市", " 凉山彝族自治州", " 雅安市", " 甘孜藏族自治州", " 阿坝藏族羌族自治州", " 德阳市", " 广元市", " 贵阳市", " 遵义市", " 安顺市", " 黔南布依族苗族自治州", " 黔东南苗族侗族自治州", " 铜仁地区", " 毕节地区", " 六盘水市", " 黔西南布依族苗族自治州", " 海口市", " 三亚市", " 五指山市", " 琼海市", " 儋州市", " 文昌市", " 万宁市", " 东方市", " 澄迈县", " 定安县", " 屯昌县", " 临高县", " 白沙黎族自治县", " 昌江黎族自治县", " 乐东黎族自治县", " 陵水黎族自治县", " 保亭黎族苗族自治县", " 琼中黎族苗族自治县", " 西双版纳傣族自治州", " 德宏傣族景颇族自治州", " 昭通市", " 昆明市", " 大理白族自治州", " 红河哈尼族彝族自治州", " 曲靖市", " 保山市", " 文山壮族苗族自治州", " 玉溪市", " 楚雄彝族自治州", " 普洱市", " 临沧市", " 怒江傈傈族自治州", " 迪庆藏族自治州", " 丽江市", " 海北藏族自治州", " 西宁市", " 海东地区", " 黄南藏族自治州", " 海南藏族自治州", " 果洛藏族自治州", " 玉树藏族自治州", " 海西蒙古族藏族自治州", " 西安市", " 咸阳市", " 延安市", " 榆林市", " 渭南市", " 商洛市", " 安康市", " 汉中市", " 宝鸡市", " 铜川市", " 防城港市", " 南宁市", " 崇左市", " 来宾市", " 柳州市", " 桂林市", " 梧州市", " 贺州市", " 贵港市", " 玉林市", " 百色市", " 钦州市", " 河池市", " 北海市", " 拉萨市", " 日喀则地区", " 山南地区", " 林芝地区", " 昌都地区", " 那曲地区", " 阿里地区", " 银川市", " 石嘴山市", " 吴忠市", " 固原市", " 中卫市", " 塔城地区", " 哈密地区", " 和田地区", " 阿勒泰地区", " 克孜勒苏柯尔克孜自治州", " 博尔塔拉蒙古自治州", " 克拉玛依市", " 乌鲁木齐市", " 石河子市", " 昌吉回族自治州", " 五家渠市", " 吐鲁番地区", " 巴音郭楞蒙古自治州", " 阿克苏地区", " 阿拉尔市", " 喀什地区", " 图木舒克市", " 伊犁哈萨克自治州", " 呼伦贝尔市", " 呼和浩特市", " 包头市", " 乌海市", " 乌兰察布市", " 通辽市", " 赤峰市", " 鄂尔多斯市", " 巴彦淖尔市", " 锡林郭勒盟", " 兴安盟", " 阿拉善盟", " 台北市", " 高雄市", " 基隆市", " 台中市", " 台南市", " 新竹市", " 嘉义市", " 澳门特别行政区", " 香港特别行政区"];
    $key = array_rand($strSq, 1);
    return $strSq[$key];

  }

  public function shop()
  {
    $strShop =["游戏手机","老人机","对讲机","手机壳贴膜","手机存储卡","数据线","充电器","无线充电器","手机耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","车载配件","拍照配件","数码相机","单电/微单相机","单反相机","拍立得","运动相机","摄像机镜头","户外器材","影棚器材","冲印服务","数码相框","数码配件","存储卡","三脚架","云台","相机包","滤镜闪光灯","手柄","相机清洁","机身附件","镜头附件","读卡器支架","电池","充电器","影音娱乐","耳麦音箱","智能音箱","便携/无线音箱","收音机","麦克风","MP3/MP4","智能手环","智能手表","智能眼镜","智能机器人","运动跟踪器","健康监测","智能配饰","智能家居","体感车","无人机","学生平板","点读机","益智录音笔","电纸书","电子词典","复读机"];
    $key = array_rand($strShop, 1);
    return $strShop[$key];
  }
}

